; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v4 - type_2 ?v5 - type_3)
 	      (pred_3 ?v1 - object ?v5 - type_3)
	      (pred_4 ?v4 - type_2 ?v8 - type_1)
	      (pred_1 ?v4 - type_2 ?v1 - object ?v8 - type_1))

   (:action op_1
       :parameters  (?v4 - type_2 ?v3 ?v2 - type_3)
       :precondition (and  (pred_2 ?v4 ?v3))
       :effect (and  (pred_2 ?v4 ?v2)
		     (not (pred_2 ?v4 ?v3))))

   (:action op_2
       :parameters (?v4 - type_2 ?v7 - object ?v6 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_3 ?v7 ?v6) (pred_2 ?v4 ?v6) (pred_4 ?v4 ?v8))
       :effect (and (pred_1 ?v4 ?v7 ?v8)
		    (not (pred_3 ?v7 ?v6)) 
		    (not (pred_4 ?v4 ?v8))))

   (:action op_3
       :parameters (?v4 - type_2 ?v7 - object ?v6 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_1 ?v4 ?v7 ?v8) (pred_2 ?v4 ?v6))
       :effect (and (pred_3 ?v7 ?v6)
		    (pred_4 ?v4 ?v8)
		    (not (pred_1 ?v4 ?v7 ?v8)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_02 obj_04 - type_2
obj_05 obj_12 obj_03 obj_06 - type_1
obj_01 obj_11 obj_10 - type_3
obj_07 obj_09 obj_08 - object)
(:init
(pred_2 obj_02 obj_10)
(pred_4 obj_02 obj_05)
(pred_4 obj_02 obj_12)
(pred_2 obj_04 obj_10)
(pred_4 obj_04 obj_03)
(pred_4 obj_04 obj_06)
(pred_3 obj_07 obj_11)
(pred_3 obj_09 obj_11)
(pred_3 obj_08 obj_01)
)
(:goal
(and
(pred_3 obj_07 obj_01)
(pred_3 obj_09 obj_10)
(pred_3 obj_08 obj_10)
)
)

(:constraints
  (always (not (pred_2 obj_02 obj_11)))
)
)

; plan
1. (op_1 obj_02 obj_10 obj_01)
   deleted: (pred_2 obj_02 obj_10)
   added: (pred_2 obj_02 obj_01)
   goals met: 0 of 3
2. (op_1 obj_04 obj_10 obj_01)
   deleted: (pred_2 obj_04 obj_10)
   added: (pred_2 obj_04 obj_01)
   goals met: 0 of 3
3. (op_2 obj_02 obj_08 obj_01 obj_12)
   deleted: (pred_3 obj_08 obj_01) (pred_4 obj_02 obj_12)
   added: (pred_1 obj_02 obj_08 obj_12)
   goals met: 0 of 3
4. (op_1 obj_04 obj_01 obj_11)
   deleted: (pred_2 obj_04 obj_01)
   added: (pred_2 obj_04 obj_11)
   goals met: 0 of 3
5. (op_1 obj_02 obj_01 obj_10)
   deleted: (pred_2 obj_02 obj_01)
   added: (pred_2 obj_02 obj_10)
   goals met: 0 of 3
6. (op_2 obj_04 obj_09 obj_11 obj_06)
   deleted: (pred_3 obj_09 obj_11) (pred_4 obj_04 obj_06)
   added: (pred_1 obj_04 obj_09 obj_06)
   goals met: 0 of 3
7. (op_2 obj_04 obj_07 obj_11 obj_03)
   deleted: (pred_3 obj_07 obj_11) (pred_4 obj_04 obj_03)
   added: (pred_1 obj_04 obj_07 obj_03)
   goals met: 0 of 3
8. (op_3 obj_02 obj_08 obj_10 obj_12)
   deleted: (pred_1 obj_02 obj_08 obj_12)
   added: (pred_3 obj_08 obj_10) (pred_4 obj_02 obj_12)
   goals met: 1 of 3
9. (op_1 obj_04 obj_11 obj_01)
   deleted: (pred_2 obj_04 obj_11)
   added: (pred_2 obj_04 obj_01)
   goals met: 1 of 3
10. (op_3 obj_04 obj_07 obj_01 obj_03)
   deleted: (pred_1 obj_04 obj_07 obj_03)
   added: (pred_3 obj_07 obj_01) (pred_4 obj_04 obj_03)
   goals met: 2 of 3
11. (op_1 obj_04 obj_01 obj_10)
   deleted: (pred_2 obj_04 obj_01)
   added: (pred_2 obj_04 obj_10)
   goals met: 2 of 3
12. (op_3 obj_04 obj_09 obj_10 obj_06)
   deleted: (pred_1 obj_04 obj_09 obj_06)
   added: (pred_3 obj_09 obj_10) (pred_4 obj_04 obj_06)
   goals met: 3 of 3
